sleemanj/optiboot/dists/diy_atmega8_series/avr/boards.txt
# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
atmega48_diy.menu.boot.optiboot.upload.protocol=arduino
atmega48_diy.menu.boot.optiboot.upload.maximum_size=3548
atmega48_diy.menu.boot.optiboot.bootloader.high_fuses=0xDD
atmega48_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega48_diy.menu.boot.optiboot=Yes, Without Tuner
atmega48_diy.menu.boot.optiboot.upload.protocol=arduino
atmega48_diy.menu.boot.optiboot.upload.maximum_size=3564
atmega48_diy.menu.boot.optiboot.bootloader.high_fuses=0xDD
atmega48_diy.menu.boot.optiboot.bootloader.file=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega48_diy.menu.boot.none=No (ISP Programmer Upload)
atmega48_diy.menu.boot.none.upload.maximum_size=4096
atmega48_diy.menu.boot.none.bootloader.high_fuses=0xDD
atmega48_diy.menu.boot.none.upload.tool=arduino:avrdude
atmega48_diy.menu.boot.none.bootloader.tool=avrdude_nobootloader


# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48_diy.menu.clock.8MHz=8MHz Internal Oscillator
atmega48_diy.menu.clock.8MHz.build.f_cpu=8000000L
atmega48_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

atmega48_diy.menu.clock.16MHz=16MHz Crystal/Resonator
atmega48_diy.menu.clock.16MHz.build.f_cpu=16000000L
atmega48_diy.menu.clock.16MHz.bootloader.low_fuses=0xF7

atmega48_diy.menu.clock.1MHz=1MHz Internal Oscillator
atmega48_diy.menu.clock.1MHz.build.f_cpu=1000000L
atmega48_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
atmega48_diy.menu.clock.1MHz.upload.speed=9600

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega48_diy.menu.lto.enable=LTO Enabled
atmega48_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
atmega48_diy.menu.lto.enable.ltoelfflags=-g -flto -fuse-linker-plugin
atmega48_diy.menu.lto.enable.ltocppflags=-flto
atmega48_diy.menu.lto.enable.ltoarcmd=gcc-
atmega48_diy.menu.lto.disable=LTO Disabled
atmega48_diy.menu.lto.disable.ltocflags=
atmega48_diy.menu.lto.disable.ltoelfflags=
atmega48_diy.menu.lto.disable.ltocppflags=
atmega48_diy.menu.lto.disable.ltoarcmd=


# }}}



################################################################################
# ATMEGA48p
#
# The ATMega48p has a small problem in the Arduino 1.0.5 because it's included 
# avrdude doesn't support it, and will report an incorrect signature or unknown
# device type.  1.6.x is fine.
#
# To fix this, edit your avrdude.conf, duplicate the section for the ATMega48 
# and change the duplicated section such that:
#
#   id = "m48p";
#   desc = "ATmega48P";
#   signature = 0x1e 0x92 0x0a;
#
# The 48 does not have a separate boot section of memory, so this means that
# optiboot uses a virtual boot method, this has a couple effects, firstly
# it takes more flash for the boot process, secondly it sacrifices the SPM_RDY
# interrupt vector, and thirdly it means that the lock bits 
# are just the simple set as with no bootloader
#
################################################################################
# {{{

atmega48p_diy.name=ATmega48P/PA/PB
atmega48p_diy.bootloader.low_fuses=0xE2
atmega48p_diy.bootloader.high_fuses=0xDD
atmega48p_diy.bootloader.extended_fuses=0x00
atmega48p_diy.bootloader.unlock_bits=0x3F
atmega48p_diy.bootloader.lock_bits=0x3F
atmega48p_diy.build.mcu=atmega48p
atmega48p_diy.build.f_cpu=8000000L
atmega48p_diy.upload.speed=57600
atmega48p_diy.build.core=arduino:arduino
atmega48p_diy.build.variant=arduino:standard
atmega48p_diy.build.board=ATMEGA48_DIY
atmega48p_diy.upload.tool=arduino:avrdude
atmega48p_diy.bootloader.tool=arduino:avrdude

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.version.atmega48p = Atmega48P
atmega48p_diy.menu.version.atmega48p.build.mcu = atmega48p

atmega48p_diy.menu.version.atmega48pa = Atmega48PA
atmega48p_diy.menu.version.atmega48pa.build.mcu = atmega48p

atmega48p_diy.menu.version.atmega48pb = Atmega48PB
atmega48p_diy.menu.version.atmega48pb.build.mcu = atmega48p


# Bootloader Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.boot.optiboot=Yes (Normal Arduino Serial/USB Upload)
atmega48p_diy.menu.boot.optiboot.upload.protocol=arduino
atmega48p_diy.menu.boot.optiboot.upload.maximum_size=3538
atmega48p_diy.menu.boot.optiboot.bootloader.high_fuses=0xDD
atmega48p_diy.menu.boot.optiboot.bootloader.file=optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega48p_diy.menu.boot.optiboot=Yes, Without Tuner
atmega48p_diy.menu.boot.optiboot.upload.protocol=arduino
atmega48p_diy.menu.boot.optiboot.upload.maximum_size=3554
atmega48p_diy.menu.boot.optiboot.bootloader.high_fuses=0xDD
atmega48p_diy.menu.boot.optiboot.bootloader.file=notuner_optiboot_{build.mcu}_{build.f_cpu}_{upload.speed}.hex

atmega48p_diy.menu.boot.none=No (ISP Programmer Upload)
atmega48p_diy.menu.boot.none.upload.maximum_size=4096
atmega48p_diy.menu.boot.none.bootloader.high_fuses=0xDD
atmega48p_diy.menu.boot.none.upload.tool=arduino:avrdude
atmega48p_diy.menu.boot.none.bootloader.tool=avrdude_nobootloader


# Speed Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega48p_diy.menu.clock.8MHz=8MHz Internal Oscillator
atmega48p_diy.menu.clock.8MHz.build.f_cpu=8000000L
atmega48p_diy.menu.clock.8MHz.bootloader.low_fuses=0xE2

atmega48p_diy.menu.clock.16MHz=16MHz Crystal/Resonator
atmega48p_diy.menu.clock.16MHz.build.f_cpu=16000000L
atmega48p_diy.menu.clock.16MHz.bootloader.low_fuses=0xF7

atmega48p_diy.menu.clock.1MHz=1MHz Internal Oscillator
atmega48p_diy.menu.clock.1MHz.build.f_cpu=1000000L
atmega48p_diy.menu.clock.1MHz.bootloader.low_fuses=0x62
atmega48p_diy.menu.clock.1MHz.upload.speed=9600

# Link Time Optimisation
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
atmega48p_diy.menu.lto.enable=LTO Enabled
atmega48p_diy.menu.lto.enable.ltocflags=-flto -fno-fat-lto-objects
atmega48p_diy.menu.lto.enable.ltoelfflags=-g -flto -fuse-linker-plugin
atmega48p_diy.menu.lto.enable.ltocppflags=-flto
atmega48p_diy.menu.lto.enable.ltoarcmd=gcc-
atmega48p_diy.menu.lto.disable=LTO Disabled
atmega48p_diy.menu.lto.disable.ltocflags=
atmega48p_diy.menu.lto.disable.ltoelfflags=
atmega48p_diy.menu.lto.disable.ltocppflags=
atmega48p_diy.menu.lto.disable.ltoarcmd=


# }}}


################################################################################
# ATMEGA328(P)
#
# EXTENDED FUSES NOTES
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# avrdude masks out some bits of the extended fuse on read, which would result 
# in verification error of the extended fuse if you give it an unmasked value
#
# The best idea is to use this fuse calculator
#
#     http://www.engbedded.com/fusecalc/ 
#
# which will helpfully tell you in red underneat the AVRDUDE arguments section
# if you should change the fuse, for example if you use that calculator with
# say "F5" for the extended fuse, and ATMega328P selected as the part name,
# then it will tell you "Note that there are some...." and that you  should use 
# "Extended: 0x05" instead.
#
#
# 1.0.5 Compatability Note
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 
#  1.0.5 has some minor problems with the non-p ATmega328 (the 328p is fine).
#
#   1: avrdude bundled in the IDE may not know about the non-p 328p signature
#       - characterised by a signature mismatch when you try and burn bootloader
#   2: avr-gcc bundled in the IDE doesn't know about the non-p at all
#       - characterised by the error "atmega328 supported for assembler only"
#
# Problem 1 can be solved by editing avrdude.conf and copying the existing m328p 
# section to make an m328 section, by changing the
#   id to m328
#   desc to ATMEGA328
#   signature to 0x1e 0x95 0x14
# You can then burn a bootloader, easy.
# 
# Problem 2 can be solved in 1 of 2 way, either;
#   a) After solving (1), use the IDE to burn the bootloader for the non-p
#       variant (eg "ATmega328 8MHz Internal Clock"), and then change the
#       selected board in the IDE to the P (eg "ATmega328p 8MHz Internal Clock")
#       variant, from which point on you can upload USING THE BOOTLOADER ONLY
#       this works because of the following reasons - you don't need to know, 
#       just if you are curious, or I want to remind myself...
#
#             i) The optiboot.c bootloader reports the signature to avrdude
#                by outputting the 3 bytes from the defines SIGNATURE_0..2 
#
#            ii) These defines are provided by avr libc from the specific files
#                /usr/lib/avr/include/avr/iom*.h
#
#           iii) The specific file (only one is included ultimately) is included
#                from /usr/lib/avr/include/avr/io.h 
#
#            iv) That file includes the iom328p.h for BOTH the 328 and the 328p
#                and it sets SIGNATURE_0..2 to the 328p bytes regardless.
#
#             v) Thus, optiboot reports the 328p bytes for both 328 and 328p
#
#            vi) Therefore when avrdude asks optiboot for the signature bytes
#                when it is on an atmega328 (non-p) it will give the bytes for 
#                the atmega328p instead, and everybody is happy.
#       
#   b) Instead of solving problem 1 in the correct manner, just change the 
#       signature bytes of the m328p section to 0x1e 0x95 0x14 and then select 
#        the P  board in your IDE (eg "ATmega328p 8MHz Internal Clock"), this 
#        works because now both the IDE and avrdude think your chip is a "p", 
#        which is fine since for your purposes they are identical.
#
################################################################################
# {{{

atmega328_diy.name=ATmega328/P/PB
atmega328_diy.bootloader.low_fuses=0xE2
atmega328_diy.bootloader.high_fuses=0xDE
atmega328_diy.bootloader.extended_fuses=0x05
atmega328_diy.bootloader.unlock_bits=0x3F
atmega328_diy.bootloader.lock_bits=0x0F
atmega328_diy.build.mcu=atmega328p
atmega328_diy.build.f_cpu=8000000L
atmega328_diy.upload.speed=57600
atmega328_diy.build.core=arduino:arduino
atmega328_diy.build.variant=arduino:standard
atmega328_diy.build.board=ATMEGA328_DIY
atmega328_diy.upload.tool=arduino:avrdude
atmega328_diy.bootloader.tool=arduino:avrdude

# Version Menu
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

atmega328_diy.menu.version.atmega328p = Atmega328P
atmega328_diy.menu.version.atmega328p.build.mcu = atmega328p

atmega328_diy.menu.version.atmega328pb = Atmega328PB
atmega328_diy.menu.version.atmega328pb.build.mcu = atmega328p

atmega328_diy.menu.version.atmega328  = ATmega328
atmega328_diy.menu.version.atmega328.build.mcu = atmega328

